{"backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"dtype": "float32", "name": "masking_1", "trainable": true, "mask_value": -1, "batch_input_shape": [null, 2, 15]}}, {"class_name": "LSTM", "config": {"units": 32, "return_state": false, "trainable": true, "name": "lstm_1", "unroll": false, "activity_regularizer": null, "recurrent_regularizer": null, "dropout": 0.2, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "return_sequences": false, "kernel_constraint": null, "unit_forget_bias": true, "bias_constraint": null, "stateful": false, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "recurrent_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 2, 15], "recurrent_dropout": 0.0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "implementation": 0}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 7, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null, "batch_input_shape": [null, 32], "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}